Sergio0799/ESP32-Control-System/src/main.cpp
  // Return degree currently facing
  return headingDegrees;
}

void turn(int degree) { // For L298Ns
  // Initialize motor driver variable & assign arbitrarily (will be reassigned)
  L298N forwardMotor = trayMotor;
  L298N reverseMotor = trayMotor;

  // Get degree robot is initially facing
  int initDegree = compassDegree();
  int targetDegree, halfwayDegree;
  // Print message to computer (troubleshooting)
  Serial.print("Initial degree of robot: ");
  Serial.println(initDegree);

  // Assign which motor will move forward/reverse based on turning
  if (degree < 0) {   // Negative degree = Turn right
    forwardMotor = leftMotor;
    reverseMotor = rightMotor;
  }
  else if (degree > 0) {  // Positive degree = Turn left
    forwardMotor = rightMotor;
    reverseMotor = leftMotor;
  }
  else {
    
  }

  // Correct for any turns made past the 0/360 degree point (North)
  if ((initDegree - degree) > 360) {
    targetDegree = initDegree - degree - 360;
    halfwayDegree = initDegree - (degree / 2) - 360;
  }
  else if ((initDegree - degree) < 0) {
    targetDegree = initDegree - degree + 360;
    halfwayDegree = initDegree - (degree / 2) + 360;
  }
  else {
    targetDegree = initDegree - degree;
    halfwayDegree = initDegree - (degree / 2);
  }

  if (halfwayDegree > 360) {
    halfwayDegree = halfwayDegree - 360;
  }
  else if (halfwayDegree < 0) {
    halfwayDegree = halfwayDegree + 360;
  }
  Serial.println(halfwayDegree);

  unsigned short dutyCycle = 50;
  int currentDegree;
  // Turn robot at incremental speed (no sudden burst of movement)
  for (; dutyCycle < 200; dutyCycle = dutyCycle + 5) {
    forwardMotor.setSpeed(dutyCycle);
    reverseMotor.setSpeed(dutyCycle);
    // Tracks must be rotating in opposite directions for static turn
    forwardMotor.forward();
    reverseMotor.backward();
    // Print message to computer (troubleshooting)
    Serial.print("Turn with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(forwardMotor.getSpeed());
    // Constantly check current degree reading and stop accelerating when halfway through turning
    currentDegree = compassDegree();
    Serial.println(currentDegree);
    if (currentDegree == halfwayDegree || currentDegree == halfwayDegree + 1 || currentDegree == halfwayDegree - 1 || currentDegree == halfwayDegree + 2 || currentDegree == halfwayDegree - 2) {
      // Print message to computer (troubleshooting)
      Serial.print("Slowing turn at degree change: ");
      Serial.println(halfwayDegree);
      break;
    }
    delay(50);
  }

  // Keep turning even when max speed is reached, until reaching halfway point of turn
  while (currentDegree != halfwayDegree && currentDegree != halfwayDegree + 1 && currentDegree != halfwayDegree - 1 && currentDegree != halfwayDegree + 2 && currentDegree != halfwayDegree - 2) {
    currentDegree = compassDegree();
    // Print message to computer (troubleshooting)
    Serial.print("Current degree: ");
    Serial.print(currentDegree);
    Serial.print(" waiting for halfway angle: ");
    Serial.println(halfwayDegree);
  }
  // Print message to computer (troubleshooting)
  Serial.print("Slowing turn at degree: ");
  Serial.println(currentDegree);

  // Decrease speed of turn after halfway (no sudden stop)
  for (; dutyCycle > 60; dutyCycle = dutyCycle - 5) {
    forwardMotor.setSpeed(dutyCycle);
    reverseMotor.setSpeed(dutyCycle);
    // Tracks must be rotating in opposite directions for static turn
    forwardMotor.forward();
    reverseMotor.backward();
    // Print message to computer (troubleshooting)
    Serial.print("Turn with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(forwardMotor.getSpeed());
    // Constantly check current degree reading and stop when desired degree change is reached
    currentDegree = compassDegree();
    if (currentDegree == targetDegree || currentDegree == targetDegree + 1 || currentDegree == targetDegree - 1 || currentDegree == targetDegree + 2 || currentDegree == targetDegree - 2) {
      // Print message to computer (troubleshooting)
      Serial.print("Slowing turn at degree change: ");
      Serial.println(initDegree - currentDegree);
      break;
    }
    delay(50);
  }

  // Keep turning even when low speed is reached, until reaching desired degree change
  while (!(currentDegree > targetDegree -3  && currentDegree < targetDegree + 3)) {
    currentDegree = compassDegree();
    // Print message to computer (troubleshooting)
    Serial.print("Current degree: ");
    Serial.println(currentDegree);
    Serial.print("Target degree: ");
    Serial.println(targetDegree);
  }
  // Print message to computer (troubleshooting)
  Serial.print("Stopping turn at degree change: ");
  Serial.println(initDegree - currentDegree);

  // Fully stop turning, should be facing object now
  forwardMotor.stop();
  reverseMotor.stop();
}

void openTray() {
  unsigned short dutyCycle = 50;
  // Move DC motor forward with increasing speed
  for (; dutyCycle < 250; dutyCycle = dutyCycle + 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.backward();
    Serial.print("Opening with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(trayMotor.getSpeed());
    delay(50);
  }
  // Move DC motor forward with decreasing speed
  for (; dutyCycle > 80; dutyCycle = dutyCycle - 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.backward();
    Serial.print("Opening with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(trayMotor.getSpeed());
    delay(50);
  }
}

void closeTray() {
  unsigned short dutyCycle = 50;
  // Move DC motor forward with increasing speed
  for (; dutyCycle < 250; dutyCycle = dutyCycle + 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.forward();
    Serial.print("Clowing with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(trayMotor.getSpeed());
    delay(50);
  }
  // Move DC motor forward with decreasing speed
  for (; dutyCycle > 80; dutyCycle = dutyCycle - 5) {
    trayMotor.setSpeed(dutyCycle);
    trayMotor.forward();
    Serial.print("Closing with duty cycle: ");
    Serial.print(dutyCycle);
    Serial.print(" with function reading of: ");
    Serial.println(trayMotor.getSpeed());
    delay(50);
  }
}

