Sergio0799/ESP32-Control-System/src/main.cpp
// int smallMinUs = 500; // 500 for SG90 servo (manually calibrated)
// int smallMaxUs = 2400; // 2400 for SG90 servo (manually calibrated)
int lastPosition;

void lowerShaft() {

  if (lastPosition < 180) {
    return;
  }

  // Turn from 180 degrees to 30 degrees in steps of 1 degree
  for (int pos = 180; pos >= 30; pos -= 1) { 
		shaftServo.write(pos);
    shaftServoInvert.write((180-pos)+30);
		delay(20);
	}

  // Print message to computer (troubleshooting)
  lastPosition = shaftServo.read();
  Serial.print("Shaft servo value: ");
  Serial.println(lastPosition);
}

void raiseShaft() {
  
  if (lastPosition > 30) {
    return;
  }

  // Turn from 50 degrees to 160 degrees in steps of 1 degree
  for (int pos = 30; pos <= 180; pos += 1) { 
		shaftServo.write(pos);
    shaftServoInvert.write((180-pos)+30);
		delay(20);             // waits 20ms for the servo to reach the position
	}

  // Print message to computer (troubleshooting)
  lastPosition = shaftServo.read();
  Serial.print("Shaft servo value: ");
  Serial.println(shaftServo.read());
}

void closeHands() {
  // Turn from 170 degrees to 10 degrees in steps of 1 degree
  for (int pos = 170; pos >= 10; pos -= 1) { 
		handServo.write(pos);
		delay(10);             // waits 10ms for the servo to reach the position
	}

  // Print message to computer (troubleshooting)
  Serial.print("Hand servo value: ");
  Serial.println(handServo.read());
}

void openHands() {
  // Turn from 10 degrees to 170 degrees in steps of 1 degree
  for (int pos = 10; pos <= 170; pos += 1) { 
		handServo.write(pos);
		delay(10);             // waits 10ms for the servo to reach the position
	}

  // Print message to computer (troubleshooting)
  Serial.print("Hand servo value: ");
  Serial.println(handServo.read());
}

int currentAngle;
void loop() {
  // put your main code here, to run repeatedly:
  // Re-initialize these necessary variable at every iteration of loop
  currentAngle = 0;
  char data = 0;
  bool error = false;
  
  // Read instruction from RPi when available
  if (PiComm.available()) {
    data = PiComm.read();
  }

  // RPi communication case (not testing)
  if (!ps5.isConnected()) { 
    // Only check what action to take if there was an instruction given
    if (data != 0) {
      // Determine what actions to take based on received instruction
      switch(data) {
        case 'A': { // Turn to a specific angle
          // Read degree of turn as int
          int degrees = PiComm.parseInt();

          // Print message to computer (troubleshooting)
          Serial.print("Turning to degree: ");
          Serial.println(degrees);
  
          turn(degrees);

          // Send confirmation code to RPi
          PiComm.write('7');
          break;
        }

        case 'C': { // Object centered, continue forward
          // Initialize necessary local variables for case
          unsigned short rightCycle = rightMotor.getSpeed();
          unsigned short leftCycle = leftMotor.getSpeed();
          unsigned short dutyCycle = 200;
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Check if tracks are moving forward at same speed (shouldn't be)
          if (rightCycle != leftCycle) {
            // Set both motors to the lowest of the two's speeds
            if (rightCycle > leftCycle) {
              dutyCycle = leftCycle;
            }
            else {
              dutyCycle = rightCycle;
            }
          }

          // Move DC motors forward with increasing speed
          for (; dutyCycle < 250; dutyCycle = dutyCycle + 10) {
            rightMotor.setSpeed(dutyCycle);
            leftMotor.setSpeed(dutyCycle);
            rightMotor.forward();
            leftMotor.forward();
            // Print message to computer (troubleshooting)
            Serial.print("Forward with duty cycle: ");
            Serial.print(dutyCycle);
            Serial.print(" with function reading of: ");
            Serial.println(rightMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }
            
          while (!newInstruction) {
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(25);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
          }

          break;
        }

        case 'D': { // Decelerate forward
          // Initialize necessary local variables for case
          unsigned short rightCycle = rightMotor.getSpeed();
          unsigned short leftCycle = leftMotor.getSpeed();
          unsigned short dutyCycle = 200;
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Check if tracks are moving forward at same speed
          if (rightCycle != leftCycle) {
            // Set both motors to the lowest of the two's speeds
            if (rightCycle > leftCycle) {
              dutyCycle = leftCycle;
            }
            else {
              dutyCycle = rightCycle;
            }
          }

          // Move DC motors forward with decreasing speed
          for (; dutyCycle > 50; dutyCycle = dutyCycle - 10) {
            rightMotor.setSpeed(dutyCycle);
            leftMotor.setSpeed(dutyCycle);
            rightMotor.forward();
            leftMotor.forward();
            // Print message to computer (troubleshooting)
            Serial.print("Forward with duty cycle: ");
            Serial.print(dutyCycle);
            Serial.print(" with function reading of: ");
            Serial.println(rightMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, stop and break out of case
            if (distance > 0 && distance < 15) {
              PiComm.write('7');
              rightMotor.stop();
              leftMotor.stop();
              newInstruction = true;
              break;
            }
            delay(50);
          }

          while (!newInstruction) {
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(25);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, stop and break out of case
            if (distance > 0 && distance < 15) {
              PiComm.write('7');
              rightMotor.stop();
              leftMotor.stop();
              newInstruction = true;
              break;
            }
          }

          break;
        }

        case 'E': { // Emergency stop
          rightMotor.stop();
          leftMotor.stop();
          error = true;
          break;
        }

        case 'F': { // Accelerate forward
          // Initialize necessary local variables for case
          unsigned short dutyCycle = 50;
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Move DC motors forward with increasing speed
          for (; dutyCycle < 250; dutyCycle = dutyCycle + 10) {
            rightMotor.setSpeed(dutyCycle);
            leftMotor.setSpeed(dutyCycle);
            rightMotor.forward();
            leftMotor.forward();
            // Print message to computer (troubleshooting)
            Serial.print("Forward with duty cycle: ");
            Serial.print(dutyCycle);
            Serial.print(" with function reading of: ");
            Serial.println(rightMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }
            
          while (!newInstruction) {
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(25);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
          }

          break;
        }

