Sergio0799/ESP32-Control-System/src/main.cpp
        case 'L': { // Turn slightly left while moving forward
          // Initialize necessary local variables for case
          unsigned short dutyCycle = leftMotor.getSpeed();
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Slowly decelerate left motor to turn slightly left
          for (; dutyCycle > 25; dutyCycle = dutyCycle - 5) {
            leftMotor.setSpeed(dutyCycle);
            leftMotor.forward();
            // Print message to computer (troubleshooting)
            Serial.print("Left with duty cycle: ");
            Serial.print(dutyCycle);
            Serial.print(" While right motor reading of: ");
            Serial.println(rightMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }

          // If finish the loop and still not centered there is an error
          if (!newInstruction) {
            error = true;
          }
          break;
        }

        case 'O': {// Everything ok bro?
          
          break;
        }

        case 'P': { // Engage pickup function
          Serial.println("Pickup function here");
          // Open hands while still above bin then lower them (around the object)
          openHands();
          lowerShaft();
          // Close hands under object and tilt it into the bin
          closeHands();
          raiseShaft();
          // Tell RPi when finished picking up
          PiComm.write('7');
          break;
        }

        case 'R': { // Turn slightly right while moving forward
          // Initialize necessary local variables for case
          unsigned short dutyCycle = rightMotor.getSpeed();
          unsigned long ping = 0;
          unsigned long distance = 0;
          boolean newInstruction = false;

          // Slowly decelerate left motor to turn slightly left
          for (; dutyCycle > 25; dutyCycle = dutyCycle - 5) {
            rightMotor.setSpeed(dutyCycle);
            rightMotor.forward();
            // Print message to computer (troubleshooting)
            Serial.print("Right with duty cycle: ");
            Serial.print(dutyCycle);
            Serial.print(" While left motor reading of: ");
            Serial.println(leftMotor.getSpeed());
            // Constantly check if another instruction is sent, if so break out of case
            if (PiComm.available()) {
              data = PiComm.read();
              newInstruction = true;
              break;
            }
            // Constanly check front ultrasonic sensor
            ping = sonar.ping_median(20);
            distance = sonar.convert_cm(ping);
            // Print message to computer (troubleshooting)
            Serial.print("Sonar reading: ");
            Serial.println(distance);
            // If object is close, break out of case
            if (distance > 0 && distance < 50) {
              PiComm.write('7');
              newInstruction = true;
              break;
            }
            delay(50);
          }

          // If finish the loop and still not centered there is an error
          if (!newInstruction) {
            error = true;
          }
          break;
        }

        case 'T': { // Do a 180
          Serial.println("Doing a full turn");
          turn(180);
          break;
        }

        default: {
          PiComm.println("Serial communication error");
          // Serial.println("Serial communication error");
          error = true;
          break;
        }
      }
    } 
    else Serial.println("Waiting for RPI or PS5 comms");
  } 
  //End of RPI code line
  else if (ps5.isConnected()) { // Manual testing through PS5 controller
    // D-Pad Buttons:
    if (ps5.Right()) closeHands();
    if (ps5.Down()) lowerShaft();
    if (ps5.Up()) raiseShaft();
    if (ps5.Left()) openHands();

    // Shape Buttons:
    if (ps5.Square()) {
      turn(90);
    }
    if (ps5.Cross()) {
      turn(-45);
    }
    if (ps5.Circle()) {
      turn(-90);
    }
    if (ps5.Triangle()) {
      turn(45);
    }

    if (ps5.PSButton()) {
      rightMotor.stop();
      leftMotor.stop();
    }

    if (ps5.Options()) {
      sensor_t sensor;
      mag.getSensor(&sensor);
      Serial.println("------------------------------------");
      Serial.print  ("Sensor:       "); Serial.println(sensor.name);
      Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
      Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
      Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" uT");
      Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" uT");
      Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" uT");  
      Serial.println("------------------------------------");
      Serial.println("");
      delay(500);

      while(!ps5.Share()) {
        // Get a new sensor event 
      sensors_event_t event; 
      mag.getEvent(&event);
    
      // Display the results (magnetic vector values are in micro-Tesla (uT)) 
      Serial.print("X: "); Serial.print(event.magnetic.x); Serial.print("  ");
      Serial.print("Y: "); Serial.print(event.magnetic.y); Serial.print("  ");
      Serial.print("Z: "); Serial.print(event.magnetic.z); Serial.print("  ");Serial.println("uT");

      // Hold the module so that Z is pointing 'up' and you can measure the heading with x&y
      // Calculate heading when the magnetometer is level, then correct for signs of axis.
      float heading = atan2(event.magnetic.y, event.magnetic.x);
      
