Sergio0799/ESP32-Control-System/src/main.cpp
      // Once you have your heading, you must then add your 'Declination Angle', which is the 'Error' of the magnetic field in your location.
      // Find yours here: http://www.magnetic-declination.com/
      // Mine is: -13* 2' W, which is ~13 Degrees, or (which we need) 0.22 radians
      // If you cannot find your Declination, comment out these two lines, your compass will be slightly off.
      float declinationAngle = 0.0573;
      heading += declinationAngle;
      Serial.println(heading);
      
      // Correct for when signs are reversed.
      if(heading < 0)
        heading += 2*PI;
        
      // Check for wrap due to addition of declination.
      if(heading > 2*PI)
        heading -= 2*PI;
      
      Serial.println(heading);
      // Convert radians to degrees for readability.
      float headingDegrees = heading * 180/PI; 
      
      Serial.print("Heading (degrees): "); Serial.println(headingDegrees);
      
      delay(500);
      }
    }

    // L1 - Turn left
    if (ps5.L1()) {
      leftMotor.setSpeed(150);
      rightMotor.setSpeed(150);
      leftMotor.backward();
      rightMotor.forward();

      while(ps5.L1()) delay(1);

      leftMotor.stop();
      rightMotor.stop();
    }
    // L2 - Turn right
    if (ps5.R1()) {
      leftMotor.setSpeed(150);
      leftMotor.forward();
      rightMotor.setSpeed(150);
      rightMotor.backward();

      while(ps5.R1()){
        delay(1);
      }

      leftMotor.stop();
      rightMotor.stop();
    }
    
    if (ps5.Touchpad()) {
      ps5.setRumble(0, sonar.ping_cm());
    }
    
    if(ps5.L2()){
      if(ps5.L2Value() > 60){
        leftMotor.setSpeed(ps5.L2Value());
        rightMotor.setSpeed(ps5.L2Value());
        rightMotor.backward();
        leftMotor.backward();
        Serial.println("Moving back");
        Serial.print("Right speed: ");
        Serial.print(rightMotor.getSpeed());
        Serial.print(" Left speed: ");
        Serial.println(leftMotor.getSpeed());
      } else {
        leftMotor.stop();
        rightMotor.stop();
      }
      
    } else if(ps5.R2()){
      if(ps5.R2Value() > 60){
        leftMotor.setSpeed(ps5.R2Value());
        rightMotor.setSpeed(ps5.R2Value());
        rightMotor.forward();
        leftMotor.forward();
        Serial.println("Moving forward");
        Serial.print(rightMotor.getSpeed());
        Serial.print(" Left speed: ");
        Serial.println(leftMotor.getSpeed());
      } else {
        leftMotor.stop();
        rightMotor.stop();
      }
    } else {
      if (leftMotor.getSpeed() > 0 || rightMotor.getSpeed() > 0){
        leftMotor.setSpeed(0);
        rightMotor.setSpeed(0);
        leftMotor.stop();
        rightMotor.stop();
        Serial.println("Reset speed to 0");
      }
      
    }
    // Serial.println(ps5.R2Value());
    // Serial.println(ps5.L2Value());
  }

  delay(100);
  // If there was an error detected then print msg to computer
  if (error) {
    Serial.println("Something went wrong!");
  }
  // Delay for visual troubleshooting
  //delay(1000);
}
